luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_reg.h
/** \brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMC.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMC	(GTM_ATOM4_CH1_SOMC)

/** \brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMI.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMI	(GTM_ATOM4_CH1_SOMI)

/** \brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMP.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMP	(GTM_ATOM4_CH1_SOMP)

/** \brief  F084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH1_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F084u)

/** Alias (User Manual Name) for GTM_ATOM4_CH1_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH1_SOMS.
*/
#define	GTM_ATOM4_CH1_CTRL_SOMS	(GTM_ATOM4_CH1_SOMS)

/** \brief  F088, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F088u)

/** \brief  F08C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F08Cu)

/** \brief  F09C, ATOM Channel Status Register */
#define GTM_ATOM4_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F09Cu)

/** \brief  F110, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F110u)

/** \brief  F114, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F114u)

/** \brief  F118, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F118u)

/** \brief  F104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F104u)

/** \brief  F124, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F124u)

/** \brief  F128, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F128u)

/** \brief  F12C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F12Cu)

/** \brief  F120, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F120u)

/** \brief  F100, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F100u)

/** \brief  F104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMC.
* To use register names with standard convension, please use GTM_ATOM4_CH2_SOMC.
*/
#define	GTM_ATOM4_CH2_CTRL_SOMC	(GTM_ATOM4_CH2_SOMC)

/** \brief  F104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMI /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF010F104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMI.
* To use register names with standard convension, please use GTM_ATOM4_CH2_SOMI.
*/
#define	GTM_ATOM4_CH2_CTRL_SOMI	(GTM_ATOM4_CH2_SOMI)

/** \brief  F104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMP /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF010F104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMP.
* To use register names with standard convension, please use GTM_ATOM4_CH2_SOMP.
*/
#define	GTM_ATOM4_CH2_CTRL_SOMP	(GTM_ATOM4_CH2_SOMP)

/** \brief  F104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH2_SOMS /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF010F104u)

/** Alias (User Manual Name) for GTM_ATOM4_CH2_SOMS.
* To use register names with standard convension, please use GTM_ATOM4_CH2_SOMS.
*/
#define	GTM_ATOM4_CH2_CTRL_SOMS	(GTM_ATOM4_CH2_SOMS)

/** \brief  F108, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F108u)

/** \brief  F10C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F10Cu)

/** \brief  F11C, ATOM Channel Status Register */
#define GTM_ATOM4_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F11Cu)

/** \brief  F190, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F190u)

/** \brief  F194, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F194u)

/** \brief  F198, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F198u)

/** \brief  F184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F184u)

/** \brief  F1A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F1A4u)

/** \brief  F1A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F1A8u)

/** \brief  F1AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F1ACu)

/** \brief  F1A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F1A0u)

/** \brief  F180, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F180u)

/** \brief  F184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH3_SOMC /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF010F184u)

