luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_MCS3_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS3_CH0_CTRG.
*/
#define	GTM_MCS3_CTRG	(GTM_MCS3_CH0_CTRG)

/** \brief  33020, MCS Channel Control Register */
#define GTM_MCS3_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0133020u)

/** \brief  33054, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH0_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0133054u)

/** \brief  33048, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0133048u)

/** \brief  3304C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013304Cu)

/** \brief  33050, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0133050u)

/** \brief  33044, MCS Channel interrupt notification register */
#define GTM_MCS3_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0133044u)

/** \brief  33040, MCS Channel Program Counter Register */
#define GTM_MCS3_CH0_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0133040u)

/** \brief  33000, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH0_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133000u)

/** \brief  33004, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH0_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133004u)

/** \brief  33008, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH0_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133008u)

/** \brief  3300C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH0_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013300Cu)

/** \brief  33010, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH0_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133010u)

/** \brief  33014, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH0_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133014u)

/** \brief  33018, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH0_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133018u)

/** \brief  3301C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH0_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013301Cu)

/** \brief  3302C, MCS Set Trigger Control Register */
#define GTM_MCS3_CH0_STRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG*)0xF013302Cu)

/** Alias (User Manual Name) for GTM_MCS3_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS3_CH0_STRG.
*/
#define	GTM_MCS3_STRG	(GTM_MCS3_CH0_STRG)

/** \brief  330A4, MCS Channel ACB Register */
#define GTM_MCS3_CH1_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01330A4u)

/** \brief  330A0, MCS Channel Control Register */
#define GTM_MCS3_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01330A0u)

/** \brief  330D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH1_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01330D4u)

/** \brief  330C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01330C8u)

/** \brief  330CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01330CCu)

/** \brief  330D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01330D0u)

/** \brief  330C4, MCS Channel interrupt notification register */
#define GTM_MCS3_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01330C4u)

/** \brief  330C0, MCS Channel Program Counter Register */
#define GTM_MCS3_CH1_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01330C0u)

/** \brief  33080, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH1_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133080u)

/** \brief  33084, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH1_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133084u)

/** \brief  33088, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH1_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133088u)

/** \brief  3308C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH1_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013308Cu)

/** \brief  33090, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH1_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133090u)

/** \brief  33094, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH1_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133094u)

/** \brief  33098, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH1_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133098u)

/** \brief  3309C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH1_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013309Cu)

/** \brief  33124, MCS Channel ACB Register */
#define GTM_MCS3_CH2_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0133124u)

/** \brief  33120, MCS Channel Control Register */
#define GTM_MCS3_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0133120u)

/** \brief  33154, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH2_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0133154u)

/** \brief  33148, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0133148u)

/** \brief  3314C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013314Cu)

/** \brief  33150, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0133150u)

/** \brief  33144, MCS Channel interrupt notification register */
#define GTM_MCS3_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0133144u)

/** \brief  33140, MCS Channel Program Counter Register */
#define GTM_MCS3_CH2_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0133140u)

