luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_reg.h
/** \brief  33100, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH2_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133100u)

/** \brief  33104, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH2_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133104u)

/** \brief  33108, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH2_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133108u)

/** \brief  3310C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH2_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013310Cu)

/** \brief  33110, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH2_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133110u)

/** \brief  33114, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH2_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133114u)

/** \brief  33118, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH2_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133118u)

/** \brief  3311C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH2_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013311Cu)

/** \brief  331A4, MCS Channel ACB Register */
#define GTM_MCS3_CH3_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01331A4u)

/** \brief  331A0, MCS Channel Control Register */
#define GTM_MCS3_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01331A0u)

/** \brief  331D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH3_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01331D4u)

/** \brief  331C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01331C8u)

/** \brief  331CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01331CCu)

/** \brief  331D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01331D0u)

/** \brief  331C4, MCS Channel interrupt notification register */
#define GTM_MCS3_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01331C4u)

/** \brief  331C0, MCS Channel Program Counter Register */
#define GTM_MCS3_CH3_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01331C0u)

/** \brief  33180, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH3_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133180u)

/** \brief  33184, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH3_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133184u)

/** \brief  33188, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH3_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133188u)

/** \brief  3318C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH3_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013318Cu)

/** \brief  33190, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH3_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133190u)

/** \brief  33194, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH3_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133194u)

/** \brief  33198, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH3_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133198u)

/** \brief  3319C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH3_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013319Cu)

/** \brief  33224, MCS Channel ACB Register */
#define GTM_MCS3_CH4_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0133224u)

/** \brief  33220, MCS Channel Control Register */
#define GTM_MCS3_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0133220u)

/** \brief  33254, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH4_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0133254u)

/** \brief  33248, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0133248u)

/** \brief  3324C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013324Cu)

/** \brief  33250, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0133250u)

/** \brief  33244, MCS Channel interrupt notification register */
#define GTM_MCS3_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0133244u)

/** \brief  33240, MCS Channel Program Counter Register */
#define GTM_MCS3_CH4_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0133240u)

/** \brief  33200, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH4_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133200u)

/** \brief  33204, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH4_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133204u)

/** \brief  33208, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH4_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133208u)

/** \brief  3320C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH4_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013320Cu)

/** \brief  33210, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH4_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133210u)

/** \brief  33214, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH4_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133214u)

/** \brief  33218, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH4_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133218u)

/** \brief  3321C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH4_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013321Cu)

/** \brief  332A4, MCS Channel ACB Register */
#define GTM_MCS3_CH5_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01332A4u)

/** \brief  332A0, MCS Channel Control Register */
#define GTM_MCS3_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01332A0u)

/** \brief  332D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH5_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01332D4u)

/** \brief  332C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01332C8u)

/** \brief  332CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01332CCu)

/** \brief  332D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01332D0u)

