luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxGtm_reg.h
/** \brief  332C4, MCS Channel interrupt notification register */
#define GTM_MCS3_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01332C4u)

/** \brief  332C0, MCS Channel Program Counter Register */
#define GTM_MCS3_CH5_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01332C0u)

/** \brief  33280, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH5_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133280u)

/** \brief  33284, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH5_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133284u)

/** \brief  33288, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH5_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133288u)

/** \brief  3328C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH5_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013328Cu)

/** \brief  33290, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH5_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133290u)

/** \brief  33294, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH5_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133294u)

/** \brief  33298, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH5_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133298u)

/** \brief  3329C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH5_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013329Cu)

/** \brief  33324, MCS Channel ACB Register */
#define GTM_MCS3_CH6_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0133324u)

/** \brief  33320, MCS Channel Control Register */
#define GTM_MCS3_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0133320u)

/** \brief  33354, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH6_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0133354u)

/** \brief  33348, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0133348u)

/** \brief  3334C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013334Cu)

/** \brief  33350, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0133350u)

/** \brief  33344, MCS Channel interrupt notification register */
#define GTM_MCS3_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0133344u)

/** \brief  33340, MCS Channel Program Counter Register */
#define GTM_MCS3_CH6_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0133340u)

/** \brief  33300, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH6_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133300u)

/** \brief  33304, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH6_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133304u)

/** \brief  33308, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH6_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133308u)

/** \brief  3330C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH6_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013330Cu)

/** \brief  33310, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH6_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133310u)

/** \brief  33314, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH6_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133314u)

/** \brief  33318, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH6_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133318u)

/** \brief  3331C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH6_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013331Cu)

/** \brief  333A4, MCS Channel ACB Register */
#define GTM_MCS3_CH7_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01333A4u)

/** \brief  333A0, MCS Channel Control Register */
#define GTM_MCS3_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01333A0u)

/** \brief  333D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS3_CH7_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01333D4u)

/** \brief  333C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS3_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01333C8u)

/** \brief  333CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS3_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01333CCu)

/** \brief  333D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS3_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01333D0u)

/** \brief  333C4, MCS Channel interrupt notification register */
#define GTM_MCS3_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01333C4u)

/** \brief  333C0, MCS Channel Program Counter Register */
#define GTM_MCS3_CH7_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01333C0u)

/** \brief  33380, MCS Channel Program Counter Register 0 */
#define GTM_MCS3_CH7_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0133380u)

/** \brief  33384, MCS Channel Program Counter Register 1 */
#define GTM_MCS3_CH7_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0133384u)

/** \brief  33388, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH7_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133388u)

/** \brief  3338C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH7_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013338Cu)

/** \brief  33390, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH7_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133390u)

/** \brief  33394, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH7_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133394u)

